app/controllers/admin/photos_controller.rb

UPDATE "photos" SET "position" = 1, "updated_at" = '2009-06-26 12:24:24' WHERE "id" = 1
---
  def update_positions
    params[:div].each_with_index do |id, position|
      Photo.update(id, {:position => position + 1})

INSERT INTO "photos" ("content_type", "updated_at", "credit", "caption", "description", "filename", "position", "created_at") VALUES('image/jpeg', '2009-06-26 12:20:25', 'asdf', 'asdf', 'asdfasd', 'hat01.jpg', NULL, '2009-06-26 12:20:25')
---
  def create
    @photo = Photo.create(params[:photo])