app/controllers/admin/tour_dates_controller.rb

SELECT * FROM "tour_dates" WHERE ("tour_dates"."id" = 1)
---
  def edit
    @tour_date = TourDate.find(params[:id])

SELECT * FROM "tour_dates" WHERE ("tour_dates"."id" = 1)
UPDATE "tour_dates" SET "price_ahead" = '', "doors_open" = '10pm', "updated_at" = '2009-07-17 11:25:29', "price_door" = '' WHERE "id" = 1
---
  def update
    @tour_date = TourDate.find(params[:id])

    respond_to do |format|
      if @tour_date.update_attributes(params[:tour_date])