app/controllers/home_controller.rb

SELECT * FROM "news_items" ORDER BY created_at DESC LIMIT 4
---
  def index
    @news_item = NewsItem.recent.first