app/controllers/tour_dates_controller.rb

  def index
    @tour_dates = TourDate.find(:all, :order => "show_date DESC")
---
SELECT * FROM "tour_dates" WHERE (show_date > '2009-07-17 11:20:36') ORDER BY show_date ASC

  def show
    @tour_date = TourDate.find(params[:id])
---
SELECT * FROM "tour_dates" WHERE ("tour_dates"."id" = 2)